import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")
ADMIN_ID = int(os.getenv("ADMIN_ID", 0))

# Настройки
MIN_METRAGE = 30
ALLOWED_CITIES = ["Ростов‑на‑Дону", "Аксай", "Батайск"]

# Настройки времени для автоматических рассылок (в минутах)
AUTO_MESSAGE_DELAYS = {
    'first': 60,      # 2 минуты для теста
    'second': 1440,     # 5 минут для теста
}

# Подписи для рассылок (теперь в config.py)
BROADCAST_FIRST_CAPTION = (
    "🎁 **Дарим бесплатный дизайн проект от нашего дизайнера** "
    "([смотреть](https://t.me/remontkvartirRND61/497)), "
    "за расчет стоимости ремонта до конца дня 👇"
)

BROADCAST_SECOND_CAPTION = (
    "☝️ **Абсолютно бесплатно забирайте гид по выбору материалов** "
    "от нашей команды."
)