import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")
# Пробуем получить первый ID
ADMIN_ID_1 = os.getenv("ADMIN_ID_1")
ADMIN_ID_2 = os.getenv("ADMIN_ID_2")

# Собираем все найденные ID в список
ADMIN_IDS = []
if ADMIN_ID_1:
    ADMIN_IDS.append(int(ADMIN_ID_1))
if ADMIN_ID_2:
    ADMIN_IDS.append(int(ADMIN_ID_2))

# Настройки
MIN_METRAGE = 30
ALLOWED_CITIES = ["Ростов‑на‑Дону", "Аксай", "Батайск"]

# Настройки времени для автоматических рассылок (в минутах)
AUTO_MESSAGE_DELAYS = {
    'first': 60,      # 60 минут для теста
    'second': 1440,    # 1440 минут = 24 часа
}

# Подписи для рассылок (теперь в config.py)
BROADCAST_FIRST_CAPTION = (
    "🎁 **Дарим бесплатный дизайн проект от нашего дизайнера** "
    "([смотреть](https://t.me/remontkvartirRND61/497)), "
    "за расчет стоимости ремонта до конца дня 👇"
)

BROADCAST_SECOND_CAPTION = (
    "☝️ **Абсолютно бесплатно забирайте гид по выбору материалов** "
    "от нашей команды."
)